docs/inclass04B.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 4B</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 4B</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgabb74d6">1. Instructions</a></li>
<li><a href="#org014a0bc">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgabb74d6" class="outline-2">
<h2 id="orgabb74d6"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the example in Bloch's Item 50 (3rd Edition):
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Broken &#8220;immutable&#8221; time period class</span>
<span style="color: #e45649;">public</span> <span style="color: #e45649;">final</span> <span style="color: #e45649;">class</span> <span style="color: #986801;">Period</span> {               <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Question 3</span>
    <span style="color: #e45649;">private</span> <span style="color: #e45649;">final</span> <span style="color: #986801;">Date</span> <span style="color: #6a1868;">start</span>;
    <span style="color: #e45649;">private</span> <span style="color: #e45649;">final</span> <span style="color: #986801;">Date</span> <span style="color: #6a1868;">end</span>;

    <span style="color: #84888b; font-style: italic;">/**</span>
<span style="color: #84888b; font-style: italic;">     * </span><span style="color: #b751b6; font-style: italic;">@param</span><span style="color: #84888b; font-style: italic;"> start the beginning of the period</span>
<span style="color: #84888b; font-style: italic;">     * </span><span style="color: #b751b6; font-style: italic;">@param</span><span style="color: #84888b; font-style: italic;"> end the end of the period; must not precede start</span>
<span style="color: #84888b; font-style: italic;">     * </span><span style="color: #b751b6; font-style: italic;">@throws</span><span style="color: #84888b; font-style: italic;"> IAE if start is after end</span>
<span style="color: #84888b; font-style: italic;">     * </span><span style="color: #b751b6; font-style: italic;">@throws</span><span style="color: #84888b; font-style: italic;"> NPE if start or end null</span>
<span style="color: #84888b; font-style: italic;">     */</span>

    <span style="color: #e45649;">public</span> <span style="color: #a626a4;">Period</span> (<span style="color: #986801;">Date</span> <span style="color: #6a1868;">start</span>, <span style="color: #986801;">Date</span> <span style="color: #6a1868;">end</span>) {
        <span style="color: #e45649;">if</span> (start.compareTo(end) &gt; 0) <span style="color: #e45649;">throw</span> <span style="color: #e45649;">new</span> <span style="color: #986801;">IAE</span>();
        <span style="color: #e45649;">this</span>.start = start; <span style="color: #e45649;">this</span>.end = end;  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Question 1</span>
    }
    <span style="color: #e45649;">public</span> <span style="color: #986801;">Date</span> <span style="color: #a626a4;">start</span>() { <span style="color: #e45649;">return</span> start;}    <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Question 2</span>
    <span style="color: #e45649;">public</span> <span style="color: #986801;">Date</span> <span style="color: #a626a4;">end</span>()   { <span style="color: #e45649;">return</span> end;}      <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Question 2</span>
}
</pre>
</div>


<ol class="org-ol">
<li>Write code that shows the problem the line marked // Question 1.</li>
<li>Write code that shows the problem the lines marked // Question 2.</li>
<li><p>
Suppose that the class declaration were:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #e45649;">class</span> <span style="color: #986801;">Period</span> { <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Question 3</span>
</pre>
</div>
<p>
Write code that shows the problem.
</p></li>
<li><p>
Bloch fixes the constructor as follows:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #a626a4;">Period</span> (<span style="color: #986801;">Date</span> <span style="color: #6a1868;">start</span>, <span style="color: #986801;">Date</span> <span style="color: #6a1868;">end</span>) {
<span style="color: #e45649;">this</span>.start = <span style="color: #e45649;">new</span> <span style="color: #986801;">Date</span>(start.getTime());  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Defensive copy</span>
<span style="color: #e45649;">this</span>.end   = <span style="color: #e45649;">new</span> <span style="color: #986801;">Date</span>(end.getTime());    <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Defensive copy</span>

<span style="color: #e45649;">if</span> (<span style="color: #e45649;">this</span>.start.compareTo(end) &gt; 0) <span style="color: #e45649;">throw</span> <span style="color: #e45649;">new</span> <span style="color: #986801;">IAE</span>();
</pre>
</div>
<ol class="org-ol">
<li>Bloch states that <code>clone()</code> would be inappropriate for copying the dates. Write code that shows the problem.</li>
<li>Bloch defers the exception check until the end, which seems to violate normal practice. What's the problem with checking early?</li>
</ol></li>
</ol>
</div>
</div>


<div id="outline-container-org014a0bc" class="outline-2">
<h2 id="org014a0bc"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
